{
    "problemID": "decay",
        "title": "Radioactive Decay",
        "text": "Marie is a nuclear engineer designing her first nuclear reactor.  To do this, she is using a system composed of two vats: one for the nuclear material and one for a cooling agent.  Since the radioactive material will decay over time, she logs the amount of material remaining in a table and notices the following pattern: the current day’s quantity of radioactive material is reduced by some divisor of the previous day’s quantity.  Formally, on successive days (other than the first, of course) if $a_i$ is the amount of material on the $i^{th}$ day, then there exists a positive integer, $x$, such that $a_{i-1}$ = $a_i \\cdot x$.  Note that $x$ may be different for each day. \n\nEach day, she will empty the second vat of its old cooling agent and refill it with $b_i$ units of cooling agent, such that $b_i$ does not exceed the capacity of the second vat.  Because of what seems like superstition amongst us non-nuclear engineers, Marie wants the amount of cooling agent and the amount of remaining radioactive material on each day to share no common divisors other than $1$.  That is, for all $i$, she wants the greatest common divisor of $a_i$ and $b_i$ to be $1$. \n\nGiven her logs on the radioactive material, Marie has asked you to determine the number of ways she can fill the second vat across all days.",
        "problem": "Given an array, $a$, representing Marie’s log of radioactive material and an integer, $c$, representing the capacity of the vats, count the number of ways to construct an array of positive integers, $b$, where each element $b_i$ in array $b$ represents the amount of cooling agent added to the second vat on the $i^{th}$ day.",
        "input": "The first line of input will consist of 2 integers, $n$ ($1 \\leq n \\leq 10^6$) and $c$ ($1 \\leq c \\leq 10^{12}$), representing the number of days in Marie’s log and the capacity of the vats (each having capacity $c$), respectively.  The next line will consist of $n$ integers where the $i^{th}$ integer, $a_i$ ($1 \\leq ai \\leq c$), represents the amount of radioactive material remaining on the $i^{th}$ day.  It is guaranteed that for all $i$ from 2 to $n$ (inclusive), $a_i \\cdot x = a_{i-1}$ where $x$ is some positive integer.  For each $i$, $x$ is not necessarily the same.",
        "output": "Output a single integer, representing the number of ways of creating the array $b$, where $b_i$ represents the amount of cooling agent that Marie will put in the second vat.  Each value $b_i$ should be a positive integer up to $c$ and share no common factors greater than $1$ with $a_i$.  Because the answer can be large, output it modulo $10^9 + 7$.",
        "sampleData": [
        {
            "input": "3 30\n30 30 1",
            "output": "1920"
        },
        {
            "input": "4 10\n8 4 2 1",
            "output": "1250"
        },
        {
            "input": "2 1000000000000\n1000000000000 1000000000000 ",
            "output": "7840000 "
        }
        ],
        "tags": ["Number Theory", "Inclusion-Exclusion", "Counting"],
        "timeLimit": 1 
}